public class Main {
    public static void main(String[] args) {
        // Установка свойств полям экземпляра через параметры конструктора
        Dog myDog = new Dog("Сербернар", "Самка", "Альфа", 5, 50);
        System.out.println("Информация о собаке: " + "\n" + "Порода: " + myDog.breed + "\n" + "Пол: " + myDog.sex + "\n" +
                "Кличка: " + myDog.name + "\n" + "Возраст: " + myDog.age + "\n" + "Вес: " + myDog.weight + "\n"); // Распечать все свойства полей экземпляра через обращение к свойствам экземпляра.

        // Изменение свойств полей экземпляра через сеттеры
        myDog.setBreed("Такса"); // передаем свойства полям через сеттер
        myDog.setSex("Самец"); // передаем свойства полям через сеттер
        myDog.setName("Жучка"); // передаем свойства полям через сеттер
        myDog.setAge(3); // передаем свойства полям через сеттер
        myDog.setWeight(4.5); // передаем свойства полям через сеттер
        System.out.println("Информация о собаке: " + "\n" + "Порода: " + myDog.getBreed() + "\n" + "Пол: " + myDog.getSex() + "\n" +
                "Кличка: " + myDog.getName() + "\n" + "Возраст: " + myDog.getAge() + "\n" + "Вес: " + myDog.getWeight() + "\n"); // Распечать все свойства полей экземпляра через геттеры.


        Dog newMyDog = new Dog("Алабай", "Самка", "Омега"); // Установка свойств полям экземпляра параметрами другого конструктора, но с одинаковым названием конструктора и другим числом параметров
        System.out.println("Информация о собаке: " + "\n" + "Порода: " + newMyDog.breed + "\n" + "Пол: " + newMyDog.sex + "\n" +
                "Кличка: " + newMyDog.name + "\n"); // Распечать все свойства полей экземпляра через обращение к свойствам экземпляра.


        Dog newMyDog1 = new Dog(); // создаем новый экземпляр класса без параметров
        newMyDog1.setBreed("Немецкая овчарка"); // передаем свойства полям через сеттер
        newMyDog1.setSex("Самец"); // передаем свойства полям через сеттер
        newMyDog1.setName("Дик"); // передаем свойства полям через сеттер
        newMyDog1.setAge(7); // передаем свойства полям через сеттер
        newMyDog1.setWeight(11); // передаем свойства полям через сеттер
        System.out.println("Информация о собаке: " + "\n" + "Порода: " + newMyDog1.getBreed() + "\n" + "Пол: " + newMyDog1.getSex() + "\n" +
                "Кличка: " + newMyDog1.getName() + "\n" + "Возраст: " + newMyDog1.getAge() + "\n" + "Вес: " + newMyDog1.getWeight() + "\n"); // Распечать все свойства полей экземпляра через обращение к свойствам экземпляра.
    }
}